{
    "intents": [
        {
            "tag": "greetings",
            "patterns": [
                "Hai",
                "halo",
                "Hi",
                "Selamat pagi",
                "Selamat siang",
                "Selamat sore",
                "Selamat malam"
            ],
            "responses": [
                "Halo, ada yang bisa kami bantu?",
                "Selamat datang di LegalScope! ada yang bisa kami bantu?"
            ],
            "context": [""]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Sampai jumpa",
                "Selamat tinggal",
                "Bye"
            ],
            "responses": [
                "Sampai jumpa lagi!",
                "Semoga hari mu menyenangkan",
                "Terimakasih telah bertanya, sampai jumpa lagi"
            ],
            "context": [""]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Terimakasih",
                "Makasih",
                "Terimakasih atas jawabannya",
                "Terimakasih atas bantuannya",
                "Thanks",
                "Thankyou"
            ],
            "responses": [
                "Senang bisa membantu anda!",
                "Tentu, senang bisa membantu",
                "Terimakasih kembali telah bertanya"
            ],
            "context": [""]
        },
        {
            "tag": "qna_1",
            "patterns": [
                "Tujuan pembentukan kitab undang-undang hukum pidana (kuhp) yang baru (uu no. 1/2023)",
                "Apa tujuan pembentukan kitab undang-undang hukum pidana (kuhp) yang baru (uu no. 1/2023)?",
                "Jelaskan tujuan pembentukan kitab undang-undang hukum pidana (kuhp) yang baru (uu no. 1/2023)",
                "Tujuan dibuatnya Kitab undang-undang hukum pidana (kuhp) yang baru (uu no. 1/2023)",
                "Bagaiamana tujuan dibuatnya kitab undang-undang hukum pidana (kuhp) yang baru (uu no. 1/2023)?",
                "Jelaskan tujuan kitab undang-undang hukum pidana (kuhp) yang baru (uu no. 1/2023)"
            ],
            "responses":[
                "Tujuan utama dari pembentukan Kitab Undang-Undang Hukum Pidana (KUHP) yang baru adalah diperlukan adanya pembaharuan hukum, yaitu demokratisasi hukum pidana karena KUHP lama merupakan produk hukum pemerintahan zaman kolonial Hindia Belanda. Pada KUHP baru pemidanaannya berorientasi pada pencegahan bukan penjatuhan hukum. Salah satu contohnya, yaitu diperhatikannya atau diaturnya hak-hak korban disamping proses hukum terhadap kejahatan yang dilakukan pelaku. Pembaharuan ini dilakukan dengan alasan filosofis, politis, sosiologis, dan praktis.\n\nFilosofis: KUHP lama disusun oleh pemerintah kolonial Belanda dan tidak sesuai dengan landasan filosofis Indonesia.\n\nSosiologis: Banyak pasal KUHP lama yang tidak lagi sesuai dengan nilai-nilai yang berlaku dalam masyarakat Indonesia modern, dan adanya kemajuan ilmu pengetahuan dan teknologi membuat berbagai pengaturan dalam KUHP menjadi tidak memadai dan ketinggalan zaman."
            ]
        },
        {
            "tag": "qna_2",
            "patterns": [
                "Apa yang dimaksud dengan kitab undang-undang hukum pidana (kuhp)?",
                "Apa itu kuhp?",
                "Jelaskan mengenai kuhp",
                "Kuhp adalah"
            ],
            "responses":[
                "Kitab Undang-Undang Hukum Pidana (KUHP) adalah kumpulan peraturan yang mengatur tentang hukum pidana di Indonesia, seperti tindak pidana, pemidanaan, dan proses hukum terkait pelanggaran hukum pidana."
            ]
        },
        {
            "tag": "qna_3",
            "patterns": [
                "Ruang lingkup berlakunya ketentuan peraturan hukum pidana kuhp menurut waktu",
                "Jelaskan ruang lingkup ketentuan peraturan hukum pidana kuhp menurut waktu",
                "Bagaimana ruang lingkup berlakunya ketentuan peraturan perundang-undangan pidana menurut waktu?",
                "Ketentuan berlakunya hukum pidana kuhp menurut waktu",
                "Ruang lingkup kuhp menurut waktu"
            ],
            "responses":[
                "Ketentuan peraturan Perundang-undangan hukum pidana menurut waktu diatur dalam asas legalitas dan asas retroaktif.\n\nAsas legalitas ini berasal dari doktrin nullum delictum nulla poena sine praevia lege poenal yang berarti tiada tindak pidana dan hukuman pidana tanpa sebelumnya ditetapkan dalam suatu undang-undang. Sebagai mana diatur dalam Pasal 1 ayat (1) UU 1/2023 \"Suatu perbuatan tidak dipidana, kecuali berdasarkan kekuatan perundang-undangan pidana yang telah ada\".\n\nAsas retroaktif menyatakan bahwa peraturan perundang-undanganitu harus sudah ada sebelum tindak pidana itu terjadi, artinya peraturan pidana tidak boleh belaku surut (retroaktif)."
            ],
            "context":[""]
        },
        {
            "tag": "qna_4",
            "patterns": [
                "Asas wilayah atau teritorial hukum pidana kuhp",
                "Jelaskan asas wilayah atau teritorial hukum pidana kuhp",
                "Apa yang dimaksud dengan asas wilayah atau teritorial dalam hukum pidana kuhp?",
                "Definisi asas wilayah atau teritorial hukum pidana kuhp",
                "Bagaimana asas wilayah atau teritorial kuhp",
                "Asas wilayah kuhp",
                "Asas teritorial kuhp"
            ],
            "responses":[
                "Asas wilayah atau teritorial adalah asas hubungan internasional yang mewajibkan suatu negara tetap berada dalam wilayah kekuasaannya. Hal ini juga berarti sebuah negara yang berdaulat bertanggung jawab untuk menjaga ketertiban hukum di wilayahnya. Negara berhak untuk memberlakukan hukuman pidana bagi siapa pun yang melakukan tindak pidana di wilayahnya. Sebagaimana diatur dalam Pasal 4 UU 1/2023 yang menyatakan bahwa hukuman pidana belaku bagi siapa pun yang melakukan tindak pidana:\n\n1. Di wilayah Negara Kesatuan Republik Indonesia (NKRI);\n. Kapal atau Pesawat Udara Indonesia; atau\n3. Di bidang teknologi informasi atau tindak pidana lainnya yang akibatnya dialami atau terjadi di wilayah Negara Kesatuan Republik Indonesia atau di Kapal Indonesia dan di Pesawat Udara Indonesia."
            ],
            "context":[""]
        },
        {
            "tag": "qna_5",
            "patterns": [
                "Ketentuan pasal 2 hukum pidana kuhp yang mengatur tentang hukum yang hidup dalam masyarakat",
                "Jelaskan pasal dalam hukum pidana KUHP tentang hukum yang hidup dalam masyarakat",
                "Bagaimana ketentuan dalam Pasal 2 tentang hukum pidana KUHP yang mengatur tentang hukum yang hidup dalam masyarakat?",
                "Peraturan tentang hukum yang hidup dalam masyarakat dalam hukum pidana kuhp",
                "Hukum pidana kuhp hukum yang hidup dalam masyarakat"
            ],
            "responses": [
                "Hukum yang hidup dalam masyarakat yang terdapat dalam Pasal 2 menjelaskan bahwa sebagaimana dimaksud pada ayat (1) berlaku dalam tempat hukum itu hidup dan sepanjang tidak diatur dalam Undang-Undang ini dan sesuai dengan nilai-nilai yang terkandung dalam Pancasila, Undang-Undang Dasar Negara Republik Indonesia Tahun 1945, hak asasi manusia, dan asas hukum umum yang diakui masyarakat beradab."
            ],
            "context":[""]
        },
        {
            "tag": "qna_6",
            "patterns": [
                "Apa yang terjadi jika terdapat perubahan peraturan perundang-undangan setelah suatu perbuatan dilakukan?",
                "Bagaimana jika peraturan perundang-undangan dirubah setelah suatu perbuatan dilakukan?"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_7",
            "patterns": [
                "Definisi asas pelindungan dalam hukum pidana KUHP",
                "Definisi asas nasional pasif dalam hukum pidana KUHP",
                "Jelaskan asas pelindungan dalam hukum pidana KUHP",
                "Jelaskan asas nasional pasif dalam hukum pidana KUHP",
                "Apa yang dimaksud dengan asas pelindungan dan asas nasional pasif dalam KUHP?"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_8",
            "patterns": [
                "Bagaimana asas nasional aktif menurut hukum pidana KUHP bagi warga negara Indonesia yang melakukan kejahatan tindak pidana di luar negeri?",
                "Ketentuan asas nasional aktif menurut hukum pidana KUHP bagi warga negara Indonesia di luar negeri",
                "Jelaskan ketentuan asas nasional aktif bagi warga negara Indonesia yang melakukan kejahatan pidana di luar negeri",
                "Asas nasional aktif bagi warga negara Indonesia yang melakukan kejahatan atau tindak pidana diluar negeri"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_9",
            "patterns": [
                "Definisi tindak pidana menurut KUHP",
                "Apa definisi tindak pidana menurut KUHP",
                "Tindak pidana menurut KUHP",
                "Jelaskan definisi tindak pidana menurut KUHP"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_10",
            "patterns": [
                "Pemufakatan jahat menurut hukum pidana KUHP",
                "Bagaimana permufakatan jahat diatur dalam KUHP?"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_11",
            "patterns": [
                "Apa saja yang termasuk dalam persiapan melakukan tindak pidana?",
                "Jelaskan hal yang termasuk dalam persiapan melakukan tindak pidana",
                "Hal yang termasuk dalam persiapan melakukan tindak pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_12",
            "patterns": [
                "Bagaimana hukum pidana KUHP mengatur tentang percobaan melakukan tindak pidana?",
                "Percobaan melakukan tindak pidana menurut hukum pidana KUHP",
                "Jelaskan peraturan mengenai percobaan melakukan tindak pidana menurut hukum pidana KUHP",
                "Percobaan melakukan tindak pidana menurut hukum pidana KUHP"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_13",
            "patterns": [
                "Pelaku tindak pidana menurut Pasal 20 hukum pidana KUHP",
                "Yang dipidana sebagai pelaku tindak pidana menurut Pasal 20 hukum pidana KUHP",
                "Siapa saja yang dapat dipidana sebagai pelaku tindak pidana menurut Pasal 20?",
                "Jelaskan pelaku terpidana menurut Pasal 20 hukum pidana KUHP"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_14",
            "patterns": [
                "Peraturan yang mengatur mengenai pembantuan dalam melakukan tindak pidana",
                "Jelaskan peraturan yang mengatur mengenai pembantuan dalam melakukan tindak pidana",
                "Bagaimana aturan mengenai pembantuan dalam melakukan tindak pidana?",
                "Pembantuan dalam melakukan tindak pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_15",
            "patterns": [
                "Peraturan yang mengatur mengenai pengulangan tindak pidana",
                "Jelaskan peraturan yang mengatur mengenai pengulangan tindak pidana",
                "Bagaimana aturan mengenai pengulangan tindak pidana?",
                "Bagaimana KUHP mengatur tentang pengulangan tindak pidana?",
                "Pengulangan melakukan tindak pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_16",
            "patterns": [
                "Jelaskan jenis sanksi pidana yang diatur dalam hukum pidana KUHP",
                "Jenis sanksi pidana menurut hukum pidana KUHP",
                "Apa saja jenis sanksi pidana yang diatur dalam KUHP?"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_17",
            "patterns": [
                "Bagaimana pembebasan pelaku tindak pidana diatur jika terjadi perubahan peraturan yang menguntungkan pelaku?"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_18",
            "patterns": [
                "Peraturan tindak pidana di luar wilayah Indonesia",
                "Bagaimana hukum pidana KUHP mengatur tindak pidana di luar wilayah Indonesia",
                "Apa yang diatur dalam Pasal 5 hukum pidana KUHP mengenai tindak pidana di luar wilayah Indonesia?"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_19",
            "patterns": [
                "Peraturan mengenai tindak pidana korupsi",
                "Bagaimana KUHP mengatur tentang tindak pidana korupsi?",
                "Jelaskan mengenai peraturan tindakan korupsi dalam hukum pidana KUHP"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_20",
            "patterns": [
                "Peraturan mengenai tindak pidana terorisme",
                "Bagaimana KUHP mengatur tentang tindak pidana terorisme?",
                "Jelaskan mengenai peraturan tindakan terorisme dalam hukum pidana KUHP"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_21",
            "patterns": [
                "Peraturan mengenai tindak pidana terhadap anak",
                "Bagaimana KUHP mengatur tentang tindak pidana terhadap anak?",
                "Jelaskan mengenai peraturan tindakan pidana terhadap anak dalam hukum pidana KUHP"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_22",
            "patterns": [
                "Peraturan mengenai tindak pidana lingkungan hidup",
                "Bagaimana KUHP mengatur tentang tindak pidana dalam lingkungan hidup?",
                "Jelaskan mengenai peraturan tindakan pidana dalam lingkungan hidup menurut hukum pidana KUHP"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_23",
            "patterns": [
                "Bagaimana KUHP memastikan perlindungan hak asasi manusia dalam proses penegakan hukum pidana?",
                "Jelaskan perlindungan hak asasi manusia dalam hukum pidana",
                "Perlindungan hak asasi manusia menurut hukum pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_24",
            "patterns": [
                "Hak-hak tersangka atau terdakwa dalam hukum pidana KUHP",
                "Hak-hak tersangka dalam hukum pidana KUHP",
                "Hak-hak terdakwa dalam hukum pidana KUHP",
                "Bagaimana pengaturan mengenai hak-hak tersangka atau terdakwa dalam KUHP?"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_25",
            "patterns": [
                "Bagaimana prosedur penyidikan dalam KUHP diatur?",
                "Alur prosedur penyidikan tindak pidana",
                "Jelaskan prosedur penyidikan untuk tindak pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_26",
            "patterns": [
                "Bagaimana KUHP mengatur proses penuntutan terhadap tindak pidana?",
                "Jelaskan proses penuntutan terhadap tindak pidana",
                "Prosedur proses penuntutan dalam kasus tindak pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_27",
            "patterns": [
                "Jelaskan aturan persidangan untuk kasus tindak pidana KUHP",
                "Aturan persidangan kasus tindak pidana KUHP",
                "Apa saja aturan persidangan kasus tindak pidana dalam KUHP?"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_28",
            "patterns": [
                "Aturan pembuktian dalam persidangan tindak pidana menurut KUHP",
                "Bagaimana aturan mengenai pembuktian dalam persidangan pidana menurut KUHP?"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_29",
            "patterns": [
                "Bagaimana ketentuan mengenai penjatuhan hukuman dalam KUHP?",
                "Aturan penjatuhan hukuman dalam KUHP"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_30",
            "patterns": [
                "Bagaimana prosedur eksekusi hukuman diatur dalam KUHP?",
                "Jelaskan prosedur eksekusi hukuman kasus tindak pidana menurut hukum pidana KUHP",
                "Prosedur eksekusi hukuman kasus tindak pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_31",
            "patterns": [
                "Pemidanaan anak menurut hukum pidana KUHP",
                "Bagaimana ketentuan mengenai pemidanaan anak diatur dalam KUHP ini?",
                "Aturan pemidanaan anak"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_32",
            "patterns": [
                "Bagaimana KUHP mengatur mengenai alternatif hukuman selain penjara?",
                "Jelaskan alternatif hukuman penjara untuk kasus tindak pidana",
                "Alternatif hukuman penjara untuk kasus tindak pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_33",
            "patterns": [
                "Bagaimana pelaksanaan hukuman mati menurut hukum pidana KUHP",
                "Aturan pelaksanaan hukuman mati menurut hukum pidana KUHP",
                "Jelaskan pelaksanaan hukuman mati kasus tindak pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_34",
            "patterns": [
                "Bagaimana ketentuan mengenai hukuman penjara diatur dalam KUHP?",
                "Hukuman penjara untuk kasus tindak pidana dalam KUHP",
                "Peraturan hukuman penjara untuk kasus tindak pidana dalam hukum pidana KUHP"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_35",
            "patterns": [
                "Bagaimana ketentuan mengenai hukuman denda diatur dalam KUHP?",
                "Ketentuan hukuman denda untuk kasus tindak pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_36",
            "patterns": [
                "Apa yang diatur mengenai kerja sosial sebagai bentuk hukuman dalam KUHP?",
                "Hukuman kerja sosial sebagai bentuk hukuman tindak pidana KUHP",
                "Jelaskan peraturan hukuman kerja sosial menurut hukum pidana KUHP"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_37",
            "patterns": [
                "Bagaimana KUHP mengatur hukuman pengawasan?",
                "Hukuman pengawasan untuk kasus tindak pidana",
                "Jelaskan peraturan hukuman pengawasan kasus tindak pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_38",
            "patterns": [
                "Bagaimana KUHP mengatur mengenai rehabilitasi bagi narapidana?",
                "Rehabilitasi bagi narapidana kasus tindak pidana",
                "Jelaskan mengenai rehabilitasi untuk narapidana kasus tindak pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_39",
            "patterns": [
                "Apa ketentuan mengenai rehabilitasi bagi korban tindak pidana dalam KUHP?",
                "Rehabilitasi korban tindak pidana",
                "Jelaskan peraturan mengenai rehabilitasi korban tindak pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_40",
            "patterns": [
                "Bagaimana ketentuan mengenai penghapusan pidana diatur dalam KUHP?",
                "Peraturan mengenai penghapusan pidana menurut hukum pidana KUHP",
                "Penghapusan pidana kasus hukum pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_41",
            "patterns": [
                "Apa saja kondisi yang dapat menyebabkan penghapusan pidana menurut KUHP?",
                "Jelaskan ketentuan kondisi yang menyebabkan penghapusan pidana"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_42",
            "patterns": [
                "Bagaimana hukum pidana KUHP mengatur mengenai grasi?",
                "Grasi dalam kasus tindak pidana",
                "Jelaskan peraturan grasi dalam kasus tindak pidana menurut hukum pidana KUHP"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_43",
            "patterns": [
                "Bagaimana hukum pidana KUHP mengatur mengenai amnesti?",
                "Amnesti dalam kasus hukum pidana",
                "Jelaskan peraturan amnesti dalam kasus tindak pidana menurut hukum pidana KUHP"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_44",
            "patterns": [
                "Bagaimana hukum pidana KUHP mengatur mengenai peradilan pidana khusus?",
                "Peraturan mengenai peradilan pidana khusus",
                "Jelaskan peraturan peradilan pidana khusus"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_45",
            "patterns": [
                "Bagaimana ketentuan mengenai tindak pidana korupsi diatur dalam peradilan pidana khusus menurut KUHP ini?",
                "Korupsi dalam peradilan pidana khusus",
                "Jelaskan peraturan mengenai korupsi dalam peradilan pidana khusus"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_46",
            "patterns": [
                "Bagaimana hukum pidana KUHP mengatur tindak pidana narkotika?",
                "Tindak pidana narkotika",
                "Jelaskan peraturan mengenai tindak pidana narkotika"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_47",
            "patterns": [
                "Bagaimana hukum pidana KUHP mengatur tindak pidana perdagangan orang?",
                "Tindak pidana perdagangan orang",
                "Jelaskan peraturan mengenai tindak pidana perdagangan orang"
            ],
            "responses": [
                
            ],
            "context":[""]
        },
        {
            "tag": "qna_48",
            "patterns": [
                "Bagaimana hukum pidana KUHP mengatur tindak pidana pencucian uang?",
                "Tindak pidana pencucian uang",
                "Jelaskan peraturan mengenai tindak pidana pencucian uang"
            ],
            "responses": [
                
            ],
            "context":[""]
        }
    ]
}
